{
  "details": [
    {
      "title": "LITERATURE SURVEY",
      "content": "<p>As technology continues to advance, organizations across industries are transitioning to digital platforms to enhance efficiency, speed, and cost-effectiveness. The Water Board is no exception to this trend. In collaboration with the Research and Development Centre in Meewatura, we are supporting this digital transformation by leveraging state-of-the-art technologies and utilizing valuable data from the Mahaweli River. While the Water Board has access to a vast amount of data and relevant sensors to collect it, there is currently no effective way to process, visualize, or make use of this growing dataset. Despite the availability of data collection tools, there is a clear gap in the efficient management and analysis of this data.</p><p>To address these challenges, we are developing an advanced water quality management system that will integrate seamlessly with the existing SCADA system used by the Water Board. This integration will harness the existing sensors to collect real-time data and incorporate predictive models for water quality, with a focus on critical parameters such as pH, turbidity, conductivity, and the chemical usage predictions for Lime, Chlorine, and PAC. The system will also offer a step-wise prediction feature, allowing users to customize water treatment steps based on real-time data, further enhancing decision-making and operational efficiency.</p><p>As part of the development process, we will review the current sensors being utilized by the Water Board, assessing their capabilities and how they can be effectively integrated into the new system. In addition, we will explore relevant architectures such as the publisher-subscriber model, which will be foundational for ensuring seamless data flow and efficient sensor integration within the system.</p><p>Currently, the Water Board lacks a unified software platform for managing sensors and visualizing data. Data processing is done manually in Excel sheets, and there is no centralized interface for sensor management, which creates inefficiencies and increases the potential for errors. Recognizing these challenges, the Water Board has requested a comprehensive dashboard that can consolidate these functionalities, streamline data processing, and reduce the need for human intervention. A similar system has been proposed by the Institute for Geoinformatics, University of Munster, in their article “Semantically Enabled Sensor Plug & Play for the Sensor Web.” This paper discusses a Sensor Plug & Play infrastructure designed to minimize human interaction, which, although different in its technology and sensor setup, offers valuable insights. These insights will guide the development of a tailored solution for the Water Board, optimizing sensor management, data processing, and ultimately the water quality management process.</p>"
    },
    {
      "title": "RESEARCH PROBLEM",
      "content": "<p><strong>No Unified Dashboard:</strong> The current water quality management system lacks a unified dashboard to visualize and interpret the data effectively. The data collected by various sensors is not consolidated in a single interface, making it challenging for decision-makers to access real-time information, trends, and alerts. A dedicated dashboard would streamline data presentation, empowering the team to monitor water quality and system performance more efficiently, facilitating better decision-making and timely interventions.</p><p><strong>No Predictive Capabilities:</strong> Currently, there is no way to predict water quality or anticipate potential issues before they arise. The system relies on reactive approaches, which makes it difficult to address problems proactively. There is also no predictive model in place to forecast water quality levels, chemical usage, or system performance, leaving the water board unable to predict changes in water quality or resource needs in advance.</p><p><strong>No Backup System, Other Than Physical Measures:</strong> The current system lacks an automated backup solution for critical failures. If issues arise, such as sensor malfunctions or system failures, there is no automated process in place to alert or recover from these events beyond physical intervention. This exposes the system to risks related to human error and delays in responding to failures, which can compromise water quality management and operational efficiency.</p><p><strong>Dependence on SCADA for Data Analysis:</strong> The SCADA system is the only method currently available for data analysis and water quality monitoring. While SCADA is crucial for gathering and displaying data, it lacks the advanced analytics and predictive capabilities necessary to optimize water quality management. The absence of supplementary systems or analytical tools limits the water board's ability to make informed decisions based on comprehensive data insights and predictions.</p>"
    },
    {
      "title": "RESEARCH GAP",
      "content": "<p>When considering the research gap, even with the existing solutions and researches the main issue would be that none of it is tailored towards the specific requirements of the water board. Most of the current solutions are tailored toward the general need and since the water boards is a major institution the specification of the software requirements tends to be specific. And considering that the application should be developed to the current and newer versions of the available technologies and the research paper and articles tend to be outdated when considering the time that they were released.</p><p>The current procedure that the water board is following to gather the data is considerably outdated since even though there are sensors available and are being used to this there is no automated way of visualizing it nor a system to process the gathered data. A system that visualizes the specific attributes that affect the water quality and a sensor detection and integration system that lets the user handle the sensors specific to gathering data on water quality is something that the water board is lacking.</p>"
    },
    {
      "title": "RESEARCH OBJECTIVE",
      "content": "<p>The main objective within this research is to provide the water board with a system that helps the process of gathering and visualizing data while also making the process of handling the SCADA system more efficient. The goal is to minimize human interactions by automating manual processes and providing a plug & play solution for SCADA system integration. To elaborate, the objectives to be completed are as follows:</p><p><b>Realtime Dashboard with the attributes related to water quality.</b><br /><br />A dashboard that gathers data from the SCADA system, visualizes the data, and showcases it in an efficient user interface tailored to the needs of the water board, with the ability to update data in real-time. Furthermore, the dashboard should also have the capability to generate reports based on the data within the dashboard.</p><p><b>SCADA System Integration.</b><br /><br />Integration of the SCADA system with the water quality management system, ensuring real-time data collection from various monitoring points along the Mahaweli river. This integration will support data-driven decisions and provide the water board with a centralized platform to monitor water quality parameters effectively.</p><p><b>Water Quality Prediction System.</b><br /><br />A predictive system to forecast water quality levels based on real-time data gathered from the SCADA system. This system will use machine learning or statistical models to predict potential changes in water quality, allowing the water board to anticipate and address issues proactively before they affect the water supply.</p><p><b>Chemical Usage Prediction System.</b><br /><br />A system designed to predict the amount of chemicals required for water treatment. This system will analyze data related to water quality and historical chemical usage, allowing for more accurate predictions and optimizing the resource allocation for chemical treatment. This will help reduce waste, enhance the efficiency of water treatment processes, and improve cost-effectiveness.</p><p><b>Flow Management System with Customization.</b><br /><br />A system designed to monitor and manage the flow of water across different plants. This system will integrate real-time data from SCADA, predictive models, and historical trends to optimize water flow management. Additionally, it will allow users to customize the water quality process by adjusting parameters and steps according to specific needs, ensuring efficient and adaptable water distribution across different plants.</p><p><b>An SMS service that notifies the relevant users within the water board.</b><br /><br />A service that can send notifications when any issue is detected within the SCADA system, alerting the relevant personnel within the water board so they can take immediate corrective actions. This service will provide real-time alerts for issues such as sensor failure, water quality deviations, or system malfunctions.</p>"
    },
    {
      "title": "METHODOLOGY",
      "content": "<p><strong>Problem Definition and Requirement Analysis:</strong> The first step of the methodology involves defining the water quality parameters such as pH, turbidity, conductivity, and chemical consumption that need to be monitored. The collaboration with the Development Centre, Meewatura, is crucial to understand their requirements for the SCADA system integration. This phase will focus on identifying current gaps in the existing water quality management system and emphasizing the need for real-time data integration, along with predictive analytics to enhance decision-making processes.</p><p><strong>SCADA System Integration:</strong> The integration of the existing SCADA system with the water quality management system will allow for real-time monitoring of water quality data from various points along the Mahaweli River. A middleware layer will be developed to ensure smooth data flow from SCADA to the new system. It will also be essential to ensure compatibility with the communication protocols used by the SCADA system, such as Modbus and OPC, to ensure seamless data transfer.</p><p><strong>Real-Time Dashboard Development:</strong> A core feature of the system is the real-time updating dashboard. This dashboard will display key water quality parameters, chemical predictions, and alerts. The user interface will be designed to be intuitive, incorporating visual elements like gauges, charts, and alarms, which will allow users to easily interpret the data and monitor the water quality trends in real time.</p><p><strong>Predictive Analytics and Model Integration:</strong> To enhance the water quality management system, machine learning models will be integrated to predict water quality parameters based on both historical and real-time data sourced from the SCADA system. Additionally, models will be developed to predict chemical consumption, such as lime, chlorine, and PAC, based on real-time water quality. A water quality prediction model will forecast future trends, helping stakeholders take proactive measures. Furthermore, a stepwise prediction model will be created that allows users to customize the prediction steps, tailoring the system to specific operational needs or scenarios.</p><p><strong>Deployment and Pilot Testing:</strong> Once the system is developed and integrated, a pilot deployment will be carried out at the Development Centre, Meewatura. This will ensure that the SCADA integration is functioning properly, and any issues or adjustments required will be identified. During this phase, feedback will be collected from end-users to refine the system further, making sure the dashboard and prediction models meet their needs and expectations.</p>"
    },
    {
      "title": "TECHNOLOGIES",
      "content": "<p style='color: grey;'>The successful completion of this project will rely on the integration of various cutting-edge technologies. These technologies are essential for ensuring the system's functionality, scalability, and efficiency in meeting the requirements of the water quality management system. By leveraging modern programming languages, robust database systems, an effective notification system, and a version control mechanism, the project will be able to achieve its goals of real-time monitoring, predictive analytics, and seamless integration with the existing infrastructure. The following sections outline the core technologies that will be employed throughout the development process:</p><p style='color: grey;'><strong>Technologies Used:</strong></p><div style='display: flex; justify-content: space-between; align-items: flex-start; gap: 15px;'><ul style='color: grey; margin: 0; padding-left: 20px; line-height: 2;'><li><strong>Programming Languages:</strong><ul style='margin-left: 20px; line-height: 2;'><li>React</li><li>Java</li></ul></li><li><strong>Database:</strong><ul style='margin-left: 20px; line-height: 2;'><li>SQL</li></ul></li><li><strong>Notification System:</strong><ul style='margin-left: 20px; line-height: 2;'><li>Twilio</li></ul></li><li><strong>Version Control:</strong><ul style='margin-left: 20px; line-height: 2;'><li>GitHub</li></ul></li></ul><img src='https://cdn.vectorstock.com/i/500p/10/34/react-native-mobile-app-abstract-concept-vector-45941034.jpg' alt='Technologies Logo' style='height: 350px; width: auto; margin-top: -30px; padding-right: 100px;' /></div>"
    }
  ]
}
