{
  "details": [
    {
      "title": "LITERATURE SURVEY",
      "content": "<p>With the advancement of technology almost all institutions are moving into the digital space due to in speed, efficiency and cost effectiveness and the water board is no deferent. We in collaboration of Research and Development Centre, Meewatura aim assist this transition while utilizing newer and enhanced technologies with the use of the data gathered from the Mahaweli river. The waterboard currently possesses a great amount of data while also having the relevant sensors to gather them. But there’s currently no way to process or visualize the ever-growing set of data gathered through their sensors. In summary even though there’s the means to gather the data there’s no way of efficiently no way to utilize the data.</p><p>In order to tackle this, we aim to provide a dashboard that updates in real time while also providing sensor integration system. And in order to provide the relevant functionalities, studies related to the current sensors that are being utilized and what functionalities and features they provide while also considering how will these sensors integrate within the application that is being created would be the focus. Furthermore, studies regarding relevant architectures such as the publisher subscriber architecture would also fall in to one of the main focus areas since that would be a main pillar of the research.</p><p>Currently the water board has no software or platform to visualize the data and handling the sensors through a user interface. Currently they gather all the data through excel sheet and manually process them and there’s no way to handle the sensors through an interface because there is no unified interface to handle them. Considering all these factors the water board requested a unified dashboard handling these functionalities since that may help them process information in a more efficient manner and this may also benefit them since it would require less human interaction since most of these will be automated and available through just a click of a button. In regards for a similar solution, a study done by the Institute for Geoinformatics, University of Munster presents an article named “semantically enabled sensor plug & play for the sensor web” which discusses about the Sensor Plug & Play infrastructure for the sensor web, with minimal human interaction. While quite similar the technology being used and the sensors that are being would be quite different. While gaining the knowledge that is available through the mentioned article, the aim would be to create a more improved and refined version that would effectively handle the sensors provided by the water board.</p>"
    },
    {
      "title": "RESEARCH PROBLEM",
      "content": "<p>No Dashboard: The absence of a unified dashboard to visualize water quality data presents a significant challenge. Currently, the data gathered by the various sensors is not consolidated or displayed in a meaningful way for decision-makers. A dedicated dashboard would streamline the presentation of real-time data, trends, and alerts, empowering the team to monitor water quality and system performance more effectively.</p><p>No Way to Predict Water Quality: Predicting water quality is another gap in the current system. Without predictive models, water quality is often assessed reactively, making it harder to anticipate issues before they arise. Implementing predictive analytics could help forecast water quality levels, allowing the water board to proactively address potential problems before they compromise the water supply.</p><p>No Way to Predict Chemical Usage: Another issue is the inability to predict the chemical usage needed for water treatment. The current process relies on manual estimates or historical data, which are not always accurate or efficient. A predictive system for chemical usage could optimize resource allocation, reduce waste, and enhance the efficiency of water treatment processes.</p><p>Inconsistent Monitoring Methods Across Plants: Water quality monitoring practices vary significantly across different plants, leading to inconsistencies in data collection and analysis. A standardized system for monitoring water quality across all plants would ensure that the data is comparable and reliable, facilitating better decision-making and resource management.</p>"
    },
    {
      "title": "RESEARCH GAP",
      "content": "<p>When considering the research gap, even with the existing solutions and researches the main issue would be that none of it is tailored towards the specific requirements of the water board. Most of the current solutions are tailored toward the general need and since the water boards is a major institution the specification of the software requirements tends to be specific. And considering that the application should be developed to the current and newer versions of the available technologies and the research paper and articles tend to be outdated when considering the time that they were released.</p><p>The current procedure that the water board is following to gather the data is considerably outdated since even though there are sensors available and are being used to this there is no automated way of visualizing it nor a system to process the gathered data. A system that visualizes the specific attributes that affect the water quality and a sensor detection and integration system that lets the user handle the sensors specific to gathering data on water quality is something that the water board is lacking.</p>"
    },
    {
      "title": "RESEARCH OBJECTIVE",
      "content": "<p>The main objective within this research is to provide the water board with a system that helps the process of gathering and visualizing data while also making the process of handling the sensors easier and more efficient. The goal is to minimize human interactions by automating manual processes and providing a plug & play solution for sensor integration. To elaborate, the objectives to be completed are as follows:</p><p><b>Realtime Dashboard with the attributes related to water quality.</b><br /><br />A dashboard that gathers data from sensors in the Mahaweli river, visualizes the data, and showcases it in an efficient user interface tailored to the needs of the water board, with the ability to update data in real-time. Furthermore, the dashboard should also have the capability to generate reports based on the data within the dashboard.</p><p><b>A plug & play sensor integration system.</b><br /><br />A plug & play sensor integration and fault detection system specifically tailored to the water board’s specifications. This should include a user interface that allows individuals within the water board to view and interact with the available sensors. This system would also incorporate an algorithm, considering architectures such as Publisher-Subscriber Architecture, to allow for seamless sensor detection and integration.</p><p><b>Water Quality Prediction System.</b><br /><br />A predictive system to forecast water quality levels based on real-time data gathered from sensors in the Mahaweli river. This system will use machine learning or statistical models to predict potential changes in water quality, allowing the water board to anticipate and address issues proactively before they affect the water supply.</p><p><b>Chemical Usage Prediction System.</b><br /><br />A system designed to predict the amount of chemicals required for water treatment. This system will analyze data related to water quality and historical chemical usage, allowing for more accurate predictions and optimizing the resource allocation for chemical treatment. This will help reduce waste, enhance the efficiency of water treatment processes, and improve cost-effectiveness.</p><p><b>Flow Management System.</b><br /><br />A system designed to monitor and manage the flow of water across different plants. This system will integrate real-time data from sensors, predictive models, and historical trends to optimize water flow management. It will allow the water board to effectively control water distribution, reduce operational costs, and ensure that water resources are used efficiently across different plants.</p><p><b>An SMS service that notifies the relevant users within the water board.</b><br /><br />A service that can send notifications when any sensor fails or is not detected, alerting the relevant personnel within the water board so they can take immediate corrective actions.</p>"
    },
    {
      "title": "METHODOLOGY",
      "content": "<p>This research done through the collaboration of the Development Centre, Meewatura will focus on providing an efficient and reliable water quality management system that would be tailored according to their needs. In order achieve this data from the Mahaweli river will be utilized, and these will be provided by the research centre. Furthermore, access to their sensors will also be provided in order to create the dashboard that would be updating in real time. In order create the sensor detection and integration functionality these will also be used while also conducting studies related to publisher subscriber architecture which would assist on the development of the mention functionality.</p>"
    },
    {
      "title": "TECHNOLOGIES",
      "content": "<div><p>In order for the project to successfully reach completion various technologies will be utilized. The technologies will be as follows:</p><p><strong>Programming Languages:</strong></p><ul><li><img width=\"400\" height=\"220\" src=\"https://logos-world.net/wp-content/uploads/2023/08/React-Symbol.png\" alt=\"React Logo\" class=\"tech-logo\" /> React<img width=\"400\" height=\"220\" src=\"https://upload.wikimedia.org/wikipedia/commons/4/44/Spring_Framework_Logo_2018.svg\" alt=\"Node.js Logo\" class=\"tech-logo\" /> Node.js</li></ul><p><strong>Database:</strong></p><br /><br /><ul><li><img width=\"350\" height=\"150\" src=\"https://blog.desdelinux.net/wp-content/uploads/2023/06/SQL.png\" alt=\"React Logo\" class=\"tech-logo\" /> SQL</li></ul><br /><br /><p><strong>Notification System:</strong></p><br /><br /><ul><li><img width=\"350\" height=\"100\" src=\"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT-OMrt3EwbCypP0TaPYChn1QGcfCRwVEUZ1w&s\" alt=\"React Logo\" class=\"tech-logo\" /> Twilio</li></ul><br /><br /><p><strong>Version Control:</strong></p><ul><li><img width=\"350\" height=\"200\" src=\"https://allvectorlogo.com/img/2021/12/github-logo-vector.png\" alt=\"React Logo\" class=\"tech-logo\" /> Github</li></ul></div>"
    }
  ]
}
